#+TITLE: Mercedes-Benz model 124 air conditioner (SA code 580) data stream
#+AUTHOR: Lauri Lindholm
#+EMAIL: archyx@pp.htv.fi
#+OPTIONS: toc:2

*** Interior air, mixing chamber, and evaporator temperatures – pins 9, 11, 12, 13

mix : Mixing chamber temperature (0x05 and 0x06) – resistance range
between 820 Ω and 20 kΩ, voltage range between 3.34 V and 0.38 V.

int. : Interior air temperature (0x07) – resistance range between
2.2 kΩ and 46 kΩ, voltage range between 4.11 V and 0.94 V.

evap. : Evaporator temperature (0x17) – resistance range between
1.8 kΩ and 34 kΩ, voltage range between 3.87 V and 0.76 V.

| resistance | voltage | int. | temp | mix |  temp | evap. | temp |
|------------+---------+------+------+-----+-------+-------+------|
|       open |    5.03 |      |      |     |       |       |      |
|      45500 |    4.11 | -128 | -0.4 |     |       |       |      |
|      44600 |    4.11 | -127 | -0.2 |     |       |       |      |
|      33560 |    3.87 | -109 |  3.4 |     |       |     0 |  0.0 |
|      32110 |    3.84 | -106 |  4.0 |     |       |     1 |  0.5 |
|      21880 |    3.46 |  -78 |  9.6 |     |       |    16 |  8.0 |
|      19610 |    3.34 |  -69 | 11.4 |   0 | 12.00 |    21 | 10.5 |
|      19360 |    3.32 |  -68 | 11.6 |   1 | 12.25 |    21 | 10.5 |
|      14900 |    3.01 |  -46 | 16.0 |  18 | 16.50 |    32 | 16.0 |
|      10050 |    2.53 |  -12 | 22.8 |  44 | 23.00 |    50 | 25.0 |
|       4680 |    1.61 |   58 | 36.8 |  99 | 36.75 |    87 | 43.5 |
|       3244 |    1.24 |   94 | 44.0 | 128 | 44.00 |   105 | 52.5 |
|       2406 |    0.98 |  125 | 50.2 | 152 | 50.00 |   119 | 59.5 |
|       2276 |    0.94 |  126 | 50.4 | 156 | 51.00 |   121 | 60.5 |
|       2153 |    0.89 |      |      | 160 | 52.00 |   123 | 61.5 |
|       1776 |    0.76 |      |      | 176 | 56.00 |   126 | 63.0 |
|       1504 |    0.66 |      |      | 191 | 59.75 |       |      |
|        998 |    0.46 |      |      | 226 | 68.50 |       |      |
|        875 |    0.41 |      |      | 240 | 72.00 |       |      |
|        817 |    0.38 |      |      | 243 | 72.75 |       |      |
|    shorted |    0.00 |      |      |     |       |       |      |
#+TBLFM: $4=($3+126)/5;%.1f::$6=($5+48)/4;%.2f::$8=$7/2;%.1f

Pull-up resistor value is 10 kΩ.


*** Exterior air temperature – pin 10

Data index 0x08.  Sensor resistance ranges between 100 Ω and >70 kΩ.
Signal voltage ranges between 4.88 V and 0.17 V.  Measurements of
resistances over 70 kΩ are flaky at best, and therefore irrelevant.
Value of -63 is never seen.

| resistance | voltage | value |  temp |
|------------+---------+-------+-------|
|       open |    5.04 |       |       |
|      87300 |    4.88 |   -64 | -32.0 |
|      75200 |    4.86 |   -62 | -31.0 |
|      69200 |    4.84 |   -62 | -31.0 |
|      66900 |    4.84 |   -61 | -30.5 |
|      47000 |    4.76 |   -55 | -27.5 |
|      32760 |    4.65 |   -46 | -23.0 |
|      21880 |    4.48 |   -33 | -16.5 |
|      14900 |    4.26 |   -17 |  -8.5 |
|      10050 |    3.96 |    -4 |  -2.0 |
|       4680 |    3.18 |    27 |  13.5 |
|       3244 |    2.73 |    43 |  21.5 |
|       2703 |    2.50 |    51 |  25.5 |
|       2153 |    2.22 |    62 |  31.0 |
|       1776 |    1.98 |    70 |  35.0 |
|       1504 |    1.79 |    78 |  39.0 |
|        998 |    1.35 |    92 |  46.0 |
|        817 |    1.16 |    97 |  48.5 |
|        676 |    1.00 |   102 |  51.0 |
|        117 |    0.21 |   125 |  62.5 |
|         95 |    0.17 |   126 |  63.0 |
|    shorted |    0.00 |       |       |
#+TBLFM: $4=$3/2;%.1f

Pull-up resistor value is 2.7 kΩ.


